In [40]:
import mysql.connector

try:
    connection = mysql.connector.connect(
        host='localhost',
        user='root',
        password='1234',
        database='advanced_sql')

    if connection.is_connected():
        print('Connected to MySQL database!')
    else:
        print('Failed to connect to the database.')
except mysql.connector.Error as e:
    print(f'Error connecting to MySQL: {e}')

Connected to MySQL database!

In [41]:
def execute_query(query):
    cursor = connection.cursor()
    cursor.execute(query)
    rows = cursor.fetchall()
    return rows

In [42]:
from decimal import Decimal
from datetime import date

def convert_value(value):
    if isinstance(value, Decimal):
        return float(value)
    elif isinstance(value, date):
        return value.strftime('%Y-%m-%d')
    return value

## Basic SQL

In [43]:
# Retrieve all columns from the "employees" table
query = """SELECT * FROM employees"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[1, 'John Doe', 35, 50000.0, 'Sales']
[2, 'Jane Smith', 28, 42000.0, 'HR']
[3, 'Mike Johnson', 42, 60000.0, 'Finance']
[4, 'Emily Brown', 29, 48000.0, 'IT']
[5, 'David Lee', 38, 55000.0, 'Sales']

In [44]:
# Find the names and ages of all employees whose age is above 30
query = """SELECT employee_name, age FROM employees WHERE age > 30"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['John Doe', 35]
['Mike Johnson', 42]
['David Lee', 38]

In [45]:
# List the unique cities in the "customers" table
query = """SELECT DISTINCT city FROM customers"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['New York']
['Los Angeles']
['Chicago']
['Houston']
['San Francisco']

In [46]:
# Calculate the total number of orders in the "orders" table
query = """SELECT COUNT(order_id) FROM orders;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[5]

In [47]:
# Find the average price of all products in the "products" table
query = """SELECT AVG(price) FROM products;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[32.618]

## SQL Grouping

In [48]:
# Calculate the total sales amount for each product in the "sales" table
query = """SELECT product_id, SUM(revenue) FROM sales GROUP BY product_id;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[201, 204.0]
[202, 70.4]
[204, 109.9]
[205, 75.6]

In [49]:
# Find the number of customers in each country from the "customers" table
query = """SELECT city, COUNT(*) FROM customers GROUP BY city"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['New York', 1]
['Los Angeles', 1]
['Chicago', 1]
['Houston', 1]
['San Francisco', 1]

In [50]:
# Calculate the average salary for each department in the "employees" table
query = """SELECT department, AVG(salary) FROM employees GROUP BY department;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['Sales', 52500.0]
['HR', 42000.0]
['Finance', 60000.0]
['IT', 48000.0]

In [51]:
# List the highest and lowest prices for each category in the "products" table
query = """SELECT category, MAX(price), MIN(price) FROM products GROUP BY category;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['Electronics', 35.2, 25.5]
['Hardware', 15.8, 15.8]
['Toys', 10.99, 10.99]
['Home', 75.6, 75.6]

In [52]:
# Find the number of orders placed by each customer in the "orders" table
query = """SELECT customer_id, COUNT(order_id) FROM orders GROUP BY customer_id;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[101, 2]
[102, 1]
[103, 1]
[105, 1]

## SQL Aggregation

In [53]:
# Calculate the total revenue generated by the company from the "sales" table
query = """SELECT SUM(revenue) FROM sales;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[459.9]

In [54]:
# Find the highest salary among all employees in the "employees" table
query = """SELECT MAX(salary) FROM employees;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[60000.0]

In [55]:
# Calculate the average age of employees in the "employees" table
query = """SELECT AVG(age) FROM employees;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[34.4]

In [56]:
# Determine the number of distinct products in the "products" table
query = """SELECT COUNT(DISTINCT product_id) FROM products;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[5]

In [57]:
# Calculate the total quantity sold for each product in the "sales" table
query = """SELECT product_id, SUM(quantity) FROM sales GROUP BY product_id;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[201, 8.0]
[202, 2.0]
[204, 10.0]
[205, 1.0]

## Advanced SQL

In [58]:
# Retrieve the top 5 employees with the highest salaries from the "employees" table
query = """SELECT * FROM employees ORDER BY salary DESC LIMIT 5;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[3, 'Mike Johnson', 42, 60000.0, 'Finance']
[5, 'David Lee', 38, 55000.0, 'Sales']
[1, 'John Doe', 35, 50000.0, 'Sales']
[4, 'Emily Brown', 29, 48000.0, 'IT']
[2, 'Jane Smith', 28, 42000.0, 'HR']

In [59]:
# Find the names of all customers who have placed orders in the "customers" table
query = """SELECT DISTINCT c.customer_name FROM customers c
            INNER JOIN orders o ON c.customer_id = o.customer_id;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['Alice Johnson']
['Bob Smith']
['Eva Lee']
['Sophia Wang']

In [60]:
# Calculate the running total sales for each month in the "sales" table
query = """SELECT 
    DATE_FORMAT(sale_date, '%Y-%m') AS month,
    SUM(revenue) FROM sales
    GROUP BY DATE_FORMAT(sale_date, '%Y-%m')
    ORDER BY DATE_FORMAT(sale_date, '%Y-%m');"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['2023-07', 459.9]

In [61]:
# Determine the average sales amount over a 3-month sliding window for each product in the "sales" table
query = """SELECT sale_date, product_id, revenue,
    AVG(revenue) OVER (PARTITION BY product_id ORDER BY sale_date
        RANGE BETWEEN INTERVAL '2' MONTH PRECEDING AND CURRENT ROW) FROM sales;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['2023-07-01', 201, 127.5, 127.5]
['2023-07-03', 201, 76.5, 102.0]
['2023-07-02', 202, 70.4, 70.4]
['2023-07-03', 204, 109.9, 109.9]
['2023-07-04', 205, 75.6, 75.6]

In [62]:
# Rank customers based on their total order amounts in the "orders" table
query = """SELECT customer_id, SUM(order_total) AS total_order_amount,
            DENSE_RANK() OVER (ORDER BY SUM(order_total) DESC) FROM orders
            GROUP BY customer_id
            ORDER BY total_order_amount DESC;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[102, 250.75, 1]
[101, 200.5, 2]
[105, 150.3, 3]
[103, 70.2, 4]

## Window Functions in SQL

In [63]:
# Calculate the cumulative sum of revenue for each product in the "sales" table
query = """SELECT product_id, revenue,
            SUM(revenue) OVER(PARTITION BY product_id ORDER BY revenue)
            FROM sales;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[201, 76.5, 76.5]
[201, 127.5, 204.0]
[202, 70.4, 70.4]
[204, 109.9, 109.9]
[205, 75.6, 75.6]

In [64]:
# Find the moving average of prices for each product over a 5-day window in the "products" table
query = """SELECT p.product_name, s.sale_date, p.price,
    AVG(p.price) OVER (PARTITION BY s.product_id ORDER BY s.sale_date ROWS BETWEEN 4 PRECEDING AND CURRENT ROW)
    AS moving_average FROM sales s
    JOIN products p ON s.product_id = p.product_id;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

['Widget A', '2023-07-01', 25.5, 25.5]
['Widget A', '2023-07-03', 25.5, 25.5]
['Gadget B', '2023-07-02', 35.2, 35.2]
['Toy D', '2023-07-03', 10.99, 10.99]
['Appliance E', '2023-07-04', 75.6, 75.6]

In [65]:
# Assign percentile ranks to employees based on their salaries in the "employees" table
query = """SELECT employee_id, salary,
            PERCENT_RANK() OVER (ORDER BY salary DESC)
            FROM employees;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[3, 60000.0, 0.0]
[5, 55000.0, 0.25]
[1, 50000.0, 0.5]
[4, 48000.0, 0.75]
[2, 42000.0, 1.0]

In [66]:
# Retrieve the previous salary for each employee in the "employees" table,
# considering 0 as the default value for the first row
query = """SELECT employee_id, salary,
            COALESCE(LAG(salary) OVER (ORDER BY employee_id), 0)
            FROM employees;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[1, 50000.0, 0.0]
[2, 42000.0, 50000.0]
[3, 60000.0, 42000.0]
[4, 48000.0, 60000.0]
[5, 55000.0, 48000.0]

In [67]:
# Calculate the sum of revenue for each product within a 2-day window,
# including the current row, in the "sales" table
query = """SELECT product_id, sale_date, revenue,
    SUM(revenue) OVER (PARTITION BY product_id ORDER BY sale_date ROWS BETWEEN 1 PRECEDING AND CURRENT ROW)
    FROM sales;"""
result = execute_query(query)
for row in result:
    formatted_row = [convert_value(value) for value in row]
    print(formatted_row)

[201, '2023-07-01', 127.5, 127.5]
[201, '2023-07-03', 76.5, 204.0]
[202, '2023-07-02', 70.4, 70.4]
[204, '2023-07-03', 109.9, 109.9]
[205, '2023-07-04', 75.6, 75.6]

In [68]:

connection.close()
print('Connection closed.')

Connection closed.